Revit 2024 API
FabricationConfiguration.GetInsulationSpecificationGroup Method
 Gets the insulation specification group from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string GetInsulationSpecificationGroup(
	int specId
)
Visual Basic
Public Function GetInsulationSpecificationGroup ( _
	specId As Integer _
) As String
Visual C++
public:
String^ GetInsulationSpecificationGroup(
	int specId
)
Parameters
specId
Type: System.Int32
 The insulation specification identifier.
Return Value
 The insulation specification group.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace